foamTemplate/constant/fvOptions
// BASELINE: A SPHERICAL VELOCITY SPONGE
// The body bounding-box centre defines the origin. radius1 encloses its corners plus
// the configured clearance; radius2 adds the configured thickness. The source is
// inactive inside radius1 and ramps the damping toward radius2. URef is the fixed
// zero UMean field. w multiplies frequency in the damping coefficient; the config calls
// this acousticDampingStrengthMultiplier; it is not a cell count.
// 
// This is a practical approximate absorber, not a perfectly matched layer or a tuned
// anechoic termination. A stronger/shorter sponge may itself reflect waves or affect
// mean flow; a larger/weaker one costs more domain cells. Disabling it leaves only
// the outer pressure boundary to handle radiation. We retain it as part of the fixed
// baseline so all geometry comparisons use the same exterior treatment.
// 
// The spherical shell is clipped by the rectangular domain. Neither the 100 mm
// padding of the larger domain nor the +Z-only padding of the reduced-domain experiment
// contains the full 250 mm ramp (the build prints the fraction that exists); do not interpret the configured
// thickness as the amount actually meshed. The y=0 inlet face also intersects the
// sphere. Test larger lateral/downstream domains and changed damping separately;
// absorption quality is not established by a successful run. timeStart/duration
// cover the entire baseline run; selectionMode all lets the radial rule select cells.

// Spherical velocity relaxation intended to reduce outgoing-wave reflections.
// UMean is a fixed zero reference, not a measured running mean. Inside radius1 the
// ramp is inactive; between radius1 and radius2 the strength rises smoothly.
// The coefficient uses w * frequency * radial blend; w is not a mesh refinement count.
// The configured shell may extend outside the world: this source cannot add mesh cells.
// This dictionary lives only in constant/fvOptions.

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}

acousticDampingSource
{
    type            acousticDampingSource;
    active          {{ACOUSTIC_DAMPING_ENABLED}};

    acousticDampingSourceCoeffs
    {
        timeStart       0;
        duration        1000000;
        selectionMode   all;
        origin          ({{DAMPING_ORIGIN}});
        radius1         {{DAMPING_INNER_RADIUS}};
        radius2         {{DAMPING_OUTER_RADIUS}};
        frequency       {{DAMPING_TARGET_FREQUENCY}};
        URef            UMean;
        w               {{DAMPING_STRENGTH_MULTIPLIER}};
    }
}


